---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.GetInsulationLiningGeometry
source: html/fe6170c6-9e54-fdef-bb16-64833ec4fb76.htm
---
# Autodesk.Revit.DB.FabricationPart.GetInsulationLiningGeometry Method

Gets insulation and lining geometry for this fabrication part.

## Syntax (C#)
```csharp
public GeometryElement GetInsulationLiningGeometry()
```

## Returns
Returns any insulation and liner geometry.